Config/Catalogs/VATRates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>VATRates</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>TaxRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TaxGroup</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NoVAT</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/VATRates/Forms/tcItemForm/Ext/Form/Module.bsl
#Region FormEventHandlers

// --------------------------------------------------------------------------------
&AtServer
Procedure OnCreateAtServer(pCancel, pStandardProcessing)
	If Parameters.Property("AvtoTest") Then
		If Parameters.AvtoTest Then
			Return;
		EndIf;	
	EndIf;
	// Let's set the properties of the form
	tcProtection.SetFormProperties(ThisObject);
	// Update tax rate if neccessary
	If ValueIsFilled(Object.Ref) Then
		vVATRateParams = cmGetVATRateParams(Object.Ref, CurrentSessionDate());
		If vVATRateParams.TaxRate <> Object.TaxRate Then
			Object.TaxRate = vVATRateParams.TaxRate;
			If vVATRateParams.NoVAT <> Object.NoVAT Then
				Object.NoVAT = vVATRateParams.NoVAT;
			EndIf;
			Modified = True;
		EndIf;
		If vVATRateParams.TaxGroup <> Object.TaxGroup And vVATRateParams.TaxGroup <> 0 Then
			Object.TaxGroup = vVATRateParams.TaxGroup;
			Modified = True;
		EndIf;
		If vVATRateParams.Description <> Object.Description And Not IsBlankString(vVATRateParams.Description) Then
			Object.Description = vVATRateParams.Description;
			Modified = True;
		EndIf;
	EndIf;
EndProcedure // OnCreateAtServer

#EndRegion
